function [min_x, min_f, N] = bisection_search(f, a, b, epsilon, l)

% Είσοδοι:
%   f:             Function handle της συνάρτησης που θα ελαχιστοποιηθεί
%   a, b:          Όρια του αρχικού διαστήματος αναζήτησης [a, b]
%   epsilon:       Η σταθερά διαχωρισμού 
%   l:   Το επιθυμητό τελικό μήκος του διαστήματος αναζήτησης ( < limit)
%
% Έξοδοι:
%   min_x:         Η εκτιμώμενη θέση του ελαχίστου (στο μέσο του τελικού διαστήματος)
%   min_f:         Η τιμή της συνάρτησης στο min_x
%   

    % Έλεγχος Αρχικών Συνθηκών
    % Αρχικοποίηση 
    ak = a;
    bk = b;
    
    N=0;
    

    % Βρόχος Επανάληψης
    while (bk - ak) > l
        % Υπολογισμός σημείων διαχωρισμού 
        pix1 = (ak + bk) / 2 - epsilon;
        pix2 = (ak + bk) / 2 + epsilon;

        % Υπολογισμός τιμών συνάρτησης
        fpix1 = f(pix1);
        fpix2 = f(pix2);
        N=N+2;

       
        % Διερεύνηση 
        if fpix1 < fpix2 % Η ελάχιστη τιμή βρίσκεται πριν το pix2 (προς τα αριστερά)
            
            bk = pix2; 
        elseif fpix1 > fpix2 % Η ελάχιστη τιμή βρίσκεται μετά το pix1 (προς τα δεξιά)
            
            ak = pix1; 
        
        end

        
       
    end

    % Τελικό αποτέλεσμα
    min_x = (ak + bk) / 2;
    min_f = f(min_x);
    %fprintf('---------------------------------------------------\n');
    %fprintf('Τερματισμός. Τελικό διάστημα: [%f, %f]\n', ak, bk);
    %fprintf('Τελικό μήκος διαστήματος: %f\n', bk - ak);
    %fprintf('Εκτιμώμενο Ελάχιστο x: %f\n', min_x);
    %fprintf('Τιμή Συνάρτησης: f(%f) = %f\n', min_x, min_f);
end

